zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/kv3x/pinctrl/MKV31F512VLL12-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MKV31F512VLL12/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MKV31F512VLL12_
#define _ZEPHYR_DTS_BINDING_MKV31F512VLL12_

#define ADC0_SE12_PTB2 KINETIS_MUX('B',2,0)
#define ADC0_SE13_PTB3 KINETIS_MUX('B',3,0)
#define ADC0_SE14_PTC0 KINETIS_MUX('C',0,0)
#define ADC0_SE15_PTC1 KINETIS_MUX('C',1,0)
#define ADC0_SE17_PTE24 KINETIS_MUX('E',24,0)
#define ADC0_SE18_PTE25 KINETIS_MUX('E',25,0)
#define ADC0_SE4b_PTC2 KINETIS_MUX('C',2,0)
#define ADC0_SE5b_PTD1 KINETIS_MUX('D',1,0)
#define ADC0_SE6b_PTD5 KINETIS_MUX('D',5,0)
#define ADC0_SE7b_PTD6 KINETIS_MUX('D',6,0)
#define ADC0_SE8_PTB0 KINETIS_MUX('B',0,0)
#define ADC0_SE9_PTB1 KINETIS_MUX('B',1,0)
#define ADC1_SE14_PTB10 KINETIS_MUX('B',10,0)
#define ADC1_SE15_PTB11 KINETIS_MUX('B',11,0)
#define ADC1_SE17_PTA17 KINETIS_MUX('A',17,0)
#define ADC1_SE4a_PTE0 KINETIS_MUX('E',0,0)
#define ADC1_SE4b_PTC8 KINETIS_MUX('C',8,0)
#define ADC1_SE5a_PTE1 KINETIS_MUX('E',1,0)
#define ADC1_SE5b_PTC9 KINETIS_MUX('C',9,0)
#define ADC1_SE6a_PTE2 KINETIS_MUX('E',2,0)
#define ADC1_SE6b_PTC10 KINETIS_MUX('C',10,0)
#define ADC1_SE7a_PTE3 KINETIS_MUX('E',3,0)
#define ADC1_SE7b_PTC11 KINETIS_MUX('C',11,0)
#define ADC1_SE8_PTB0 KINETIS_MUX('B',0,0)
#define ADC1_SE9_PTB1 KINETIS_MUX('B',1,0)
#define CLKOUT_PTC3 KINETIS_MUX('C',3,5)
#define CMP0_IN0_PTC6 KINETIS_MUX('C',6,0)
#define CMP0_IN1_PTC7 KINETIS_MUX('C',7,0)
#define CMP0_IN2_PTC8 KINETIS_MUX('C',8,0)
#define CMP0_IN3_PTC9 KINETIS_MUX('C',9,0)
#define CMP0_OUT_PTB20 KINETIS_MUX('B',20,6)
#define CMP0_OUT_PTC5 KINETIS_MUX('C',5,6)
#define CMP1_IN0_PTC2 KINETIS_MUX('C',2,0)
#define CMP1_IN1_PTC3 KINETIS_MUX('C',3,0)
#define CMP1_OUT_PTB21 KINETIS_MUX('B',21,6)
#define CMP1_OUT_PTC4 KINETIS_MUX('C',4,6)
#define EWM_IN_PTB16 KINETIS_MUX('B',16,6)
#define EWM_IN_PTD4 KINETIS_MUX('D',4,6)
#define EWM_IN_PTE25 KINETIS_MUX('E',25,6)
#define EWM_OUT_b_PTB17 KINETIS_MUX('B',17,6)
#define EWM_OUT_b_PTD5 KINETIS_MUX('D',5,6)
#define EWM_OUT_b_PTE24 KINETIS_MUX('E',24,6)
#define EXTAL0_PTA18 KINETIS_MUX('A',18,0)
#define FTM0_CH0_PTA3 KINETIS_MUX('A',3,3)
#define FTM0_CH0_PTC1 KINETIS_MUX('C',1,4)
#define FTM0_CH1_PTA4 KINETIS_MUX('A',4,3)
#define FTM0_CH1_PTC2 KINETIS_MUX('C',2,4)
#define FTM0_CH2_PTA5 KINETIS_MUX('A',5,3)
#define FTM0_CH2_PTC3 KINETIS_MUX('C',3,4)
#define FTM0_CH2_PTC5 KINETIS_MUX('C',5,7)
#define FTM0_CH3_PTC4 KINETIS_MUX('C',4,4)
#define FTM0_CH4_PTD4 KINETIS_MUX('D',4,4)
#define FTM0_CH5_PTA0 KINETIS_MUX('A',0,3)
#define FTM0_CH5_PTD5 KINETIS_MUX('D',5,4)
#define FTM0_CH6_PTA1 KINETIS_MUX('A',1,3)
#define FTM0_CH6_PTD6 KINETIS_MUX('D',6,4)
#define FTM0_CH7_PTA2 KINETIS_MUX('A',2,3)
#define FTM0_CH7_PTD7 KINETIS_MUX('D',7,4)
#define FTM0_FLT0_PTB3 KINETIS_MUX('B',3,6)
#define FTM0_FLT0_PTD6 KINETIS_MUX('D',6,6)
#define FTM0_FLT1_PTB10 KINETIS_MUX('B',10,6)
#define FTM0_FLT1_PTD7 KINETIS_MUX('D',7,6)
#define FTM0_FLT2_PTA18 KINETIS_MUX('A',18,3)
#define FTM0_FLT2_PTB11 KINETIS_MUX('B',11,6)
#define FTM0_FLT3_PTB2 KINETIS_MUX('B',2,6)
#define FTM1_CH0_PTA12 KINETIS_MUX('A',12,3)
#define FTM1_CH0_PTB0 KINETIS_MUX('B',0,3)
#define FTM1_CH1_PTA13 KINETIS_MUX('A',13,3)
#define FTM1_CH1_PTB1 KINETIS_MUX('B',1,3)
#define FTM1_FLT0_PTA19 KINETIS_MUX('A',19,3)
#define FTM1_QD_PHA_PTA12 KINETIS_MUX('A',12,7)
#define FTM1_QD_PHA_PTB0 KINETIS_MUX('B',0,6)
#define FTM1_QD_PHB_PTA13 KINETIS_MUX('A',13,7)
#define FTM1_QD_PHB_PTB1 KINETIS_MUX('B',1,6)
#define FTM2_CH0_PTB18 KINETIS_MUX('B',18,3)
#define FTM2_CH1_PTB19 KINETIS_MUX('B',19,3)
#define FTM2_FLT0_PTC9 KINETIS_MUX('C',9,6)
#define FTM2_QD_PHA_PTB18 KINETIS_MUX('B',18,6)
#define FTM2_QD_PHB_PTB19 KINETIS_MUX('B',19,6)
#define FTM3_CH0_PTD0 KINETIS_MUX('D',0,4)
#define FTM3_CH0_PTE5 KINETIS_MUX('E',5,6)
#define FTM3_CH1_PTD1 KINETIS_MUX('D',1,4)
#define FTM3_CH1_PTE6 KINETIS_MUX('E',6,6)
#define FTM3_CH2_PTD2 KINETIS_MUX('D',2,4)
#define FTM3_CH3_PTD3 KINETIS_MUX('D',3,4)
#define FTM3_CH4_PTC8 KINETIS_MUX('C',8,3)
#define FTM3_CH5_PTC9 KINETIS_MUX('C',9,3)
#define FTM3_CH6_PTC10 KINETIS_MUX('C',10,3)
#define FTM3_CH7_PTC11 KINETIS_MUX('C',11,3)
#define FTM3_FLT0_PTC12 KINETIS_MUX('C',12,6)
#define FTM_CLKIN0_PTA18 KINETIS_MUX('A',18,4)
#define FTM_CLKIN0_PTB16 KINETIS_MUX('B',16,4)
#define FTM_CLKIN1_PTA19 KINETIS_MUX('A',19,4)
#define FTM_CLKIN1_PTB17 KINETIS_MUX('B',17,4)
#define I2C0_SCL_PTB0 KINETIS_MUX('B',0,2)
#define I2C0_SCL_PTB2 KINETIS_MUX('B',2,2)
#define I2C0_SCL_PTD2 KINETIS_MUX('D',2,7)
#define I2C0_SCL_PTE24 KINETIS_MUX('E',24,5)
#define I2C0_SDA_PTB1 KINETIS_MUX('B',1,2)
#define I2C0_SDA_PTB3 KINETIS_MUX('B',3,2)
#define I2C0_SDA_PTD3 KINETIS_MUX('D',3,7)
#define I2C0_SDA_PTE25 KINETIS_MUX('E',25,5)
#define I2C1_SCL_PTC10 KINETIS_MUX('C',10,2)
#define I2C1_SCL_PTE1 KINETIS_MUX('E',1,6)
#define I2C1_SDA_PTC11 KINETIS_MUX('C',11,2)
#define I2C1_SDA_PTE0 KINETIS_MUX('E',0,6)
#define JTAG_TCLK_PTA0 KINETIS_MUX('A',0,7)
#define JTAG_TDI_PTA1 KINETIS_MUX('A',1,7)
#define JTAG_TDO_PTA2 KINETIS_MUX('A',2,7)
#define JTAG_TMS_PTA3 KINETIS_MUX('A',3,7)
#define JTAG_TRST_b_PTA5 KINETIS_MUX('A',5,7)
#define KINETIS_MUX(port, pin, mux)		 (((((port) - 'A') & 0xF) << 28) |	 (((pin) & 0x3F) << 22) |		 (((mux) & 0x7) << 8))
#define LLWU_P0_PTE1 KINETIS_MUX('E',1,1)
#define LLWU_P10_PTC6 KINETIS_MUX('C',6,1)
#define LLWU_P11_PTC11 KINETIS_MUX('C',11,1)
#define LLWU_P12_PTD0 KINETIS_MUX('D',0,1)
#define LLWU_P13_PTD2 KINETIS_MUX('D',2,1)
#define LLWU_P14_PTD4 KINETIS_MUX('D',4,1)
#define LLWU_P15_PTD6 KINETIS_MUX('D',6,1)
#define LLWU_P1_PTE2 KINETIS_MUX('E',2,1)
#define LLWU_P2_PTE4 KINETIS_MUX('E',4,1)
#define LLWU_P3_PTA4 KINETIS_MUX('A',4,1)
#define LLWU_P4_PTA13 KINETIS_MUX('A',13,1)
#define LLWU_P5_PTB0 KINETIS_MUX('B',0,1)
#define LLWU_P6_PTC1 KINETIS_MUX('C',1,1)
#define LLWU_P7_PTC3 KINETIS_MUX('C',3,1)
#define LLWU_P8_PTC4 KINETIS_MUX('C',4,1)
#define LLWU_P9_PTC5 KINETIS_MUX('C',5,1)
#define LPTMR0_ALT1_PTA19 KINETIS_MUX('A',19,6)
#define LPTMR0_ALT2_PTC5 KINETIS_MUX('C',5,3)
#define NMI_b_PTA4 KINETIS_MUX('A',4,7)
#define PDB0_EXTRG_PTC0 KINETIS_MUX('C',0,3)
#define PDB0_EXTRG_PTC6 KINETIS_MUX('C',6,3)
#define PTA0 KINETIS_MUX('A',0,1)
#define PTA1 KINETIS_MUX('A',1,1)
#define PTA12 KINETIS_MUX('A',12,1)
#define PTA13 KINETIS_MUX('A',13,1)
#define PTA14 KINETIS_MUX('A',14,1)
#define PTA15 KINETIS_MUX('A',15,1)
#define PTA16 KINETIS_MUX('A',16,1)
#define PTA17 KINETIS_MUX('A',17,1)
#define PTA18 KINETIS_MUX('A',18,1)
#define PTA19 KINETIS_MUX('A',19,1)
#define PTA2 KINETIS_MUX('A',2,1)
#define PTA3 KINETIS_MUX('A',3,1)
#define PTA4 KINETIS_MUX('A',4,1)
#define PTA5 KINETIS_MUX('A',5,1)
#define PTB0 KINETIS_MUX('B',0,1)
#define PTB1 KINETIS_MUX('B',1,1)
#define PTB10 KINETIS_MUX('B',10,1)
#define PTB11 KINETIS_MUX('B',11,1)
#define PTB16 KINETIS_MUX('B',16,1)
#define PTB17 KINETIS_MUX('B',17,1)
#define PTB18 KINETIS_MUX('B',18,1)
#define PTB19 KINETIS_MUX('B',19,1)
#define PTB2 KINETIS_MUX('B',2,1)
#define PTB20 KINETIS_MUX('B',20,1)
#define PTB21 KINETIS_MUX('B',21,1)
#define PTB22 KINETIS_MUX('B',22,1)
#define PTB23 KINETIS_MUX('B',23,1)
#define PTB3 KINETIS_MUX('B',3,1)
#define PTB9 KINETIS_MUX('B',9,1)
#define PTC0 KINETIS_MUX('C',0,1)
#define PTC1 KINETIS_MUX('C',1,1)
#define PTC10 KINETIS_MUX('C',10,1)
#define PTC11 KINETIS_MUX('C',11,1)
#define PTC12 KINETIS_MUX('C',12,1)
#define PTC13 KINETIS_MUX('C',13,1)
#define PTC14 KINETIS_MUX('C',14,1)
#define PTC15 KINETIS_MUX('C',15,1)
#define PTC16 KINETIS_MUX('C',16,1)
#define PTC17 KINETIS_MUX('C',17,1)
#define PTC18 KINETIS_MUX('C',18,1)
#define PTC2 KINETIS_MUX('C',2,1)
#define PTC3 KINETIS_MUX('C',3,1)
#define PTC4 KINETIS_MUX('C',4,1)
#define PTC5 KINETIS_MUX('C',5,1)
#define PTC6 KINETIS_MUX('C',6,1)
#define PTC7 KINETIS_MUX('C',7,1)
#define PTC8 KINETIS_MUX('C',8,1)
#define PTC9 KINETIS_MUX('C',9,1)
#define PTD0 KINETIS_MUX('D',0,1)
#define PTD1 KINETIS_MUX('D',1,1)
#define PTD2 KINETIS_MUX('D',2,1)
#define PTD3 KINETIS_MUX('D',3,1)
#define PTD4 KINETIS_MUX('D',4,1)
#define PTD5 KINETIS_MUX('D',5,1)
#define PTD6 KINETIS_MUX('D',6,1)
#define PTD7 KINETIS_MUX('D',7,1)
#define PTE0 KINETIS_MUX('E',0,1)
#define PTE1 KINETIS_MUX('E',1,1)
#define PTE2 KINETIS_MUX('E',2,1)
#define PTE24 KINETIS_MUX('E',24,1)
#define PTE25 KINETIS_MUX('E',25,1)
#define PTE26 KINETIS_MUX('E',26,1)
#define PTE3 KINETIS_MUX('E',3,1)
#define PTE4 KINETIS_MUX('E',4,1)
#define PTE5 KINETIS_MUX('E',5,1)
#define PTE6 KINETIS_MUX('E',6,1)
#define SPI0_PCS0_PTA14 KINETIS_MUX('A',14,2)
#define SPI0_PCS0_PTC4 KINETIS_MUX('C',4,2)
#define SPI0_PCS0_PTD0 KINETIS_MUX('D',0,2)
#define SPI0_PCS1_PTC3 KINETIS_MUX('C',3,2)
#define SPI0_PCS1_PTD4 KINETIS_MUX('D',4,2)
#define SPI0_PCS2_PTC2 KINETIS_MUX('C',2,2)
#define SPI0_PCS2_PTD5 KINETIS_MUX('D',5,2)
#define SPI0_PCS3_PTC1 KINETIS_MUX('C',1,2)
#define SPI0_PCS3_PTD6 KINETIS_MUX('D',6,2)
#define SPI0_PCS4_PTC0 KINETIS_MUX('C',0,2)
#define SPI0_PCS5_PTB23 KINETIS_MUX('B',23,3)
#define SPI0_SCK_PTA15 KINETIS_MUX('A',15,2)
#define SPI0_SCK_PTC5 KINETIS_MUX('C',5,2)
#define SPI0_SCK_PTD1 KINETIS_MUX('D',1,2)
#define SPI0_SIN_PTA17 KINETIS_MUX('A',17,2)
#define SPI0_SIN_PTC7 KINETIS_MUX('C',7,2)
#define SPI0_SIN_PTD3 KINETIS_MUX('D',3,2)
#define SPI0_SOUT_PTA16 KINETIS_MUX('A',16,2)
#define SPI0_SOUT_PTC6 KINETIS_MUX('C',6,2)
#define SPI0_SOUT_PTD2 KINETIS_MUX('D',2,2)
#define SPI1_PCS0_PTB10 KINETIS_MUX('B',10,2)
#define SPI1_PCS0_PTD4 KINETIS_MUX('D',4,7)
#define SPI1_PCS0_PTE4 KINETIS_MUX('E',4,2)
#define SPI1_PCS1_PTB9 KINETIS_MUX('B',9,2)
#define SPI1_PCS1_PTE0 KINETIS_MUX('E',0,2)
#define SPI1_PCS2_PTE5 KINETIS_MUX('E',5,2)
#define SPI1_PCS3_PTE6 KINETIS_MUX('E',6,2)
#define SPI1_SCK_PTB11 KINETIS_MUX('B',11,2)
#define SPI1_SCK_PTD5 KINETIS_MUX('D',5,7)
#define SPI1_SCK_PTE2 KINETIS_MUX('E',2,2)
#define SPI1_SIN_PTB17 KINETIS_MUX('B',17,2)
#define SPI1_SIN_PTD7 KINETIS_MUX('D',7,7)
#define SPI1_SIN_PTE1 KINETIS_MUX('E',1,7)
#define SPI1_SIN_PTE3 KINETIS_MUX('E',3,2)
#define SPI1_SOUT_PTB16 KINETIS_MUX('B',16,2)
#define SPI1_SOUT_PTD6 KINETIS_MUX('D',6,7)
#define SPI1_SOUT_PTE1 KINETIS_MUX('E',1,2)
#define SPI1_SOUT_PTE3 KINETIS_MUX('E',3,7)
#define TRACE_SWO_PTA2 KINETIS_MUX('A',2,7)
#define UART0_CTS_b_PTA0 KINETIS_MUX('A',0,2)
#define UART0_CTS_b_PTA16 KINETIS_MUX('A',16,3)
#define UART0_CTS_b_PTB3 KINETIS_MUX('B',3,3)
#define UART0_CTS_b_PTD5 KINETIS_MUX('D',5,3)
#define UART0_RTS_b_PTA17 KINETIS_MUX('A',17,3)
#define UART0_RTS_b_PTA3 KINETIS_MUX('A',3,2)
#define UART0_RTS_b_PTB2 KINETIS_MUX('B',2,3)
#define UART0_RTS_b_PTD4 KINETIS_MUX('D',4,3)
#define UART0_RX_PTA1 KINETIS_MUX('A',1,2)
#define UART0_RX_PTA15 KINETIS_MUX('A',15,3)
#define UART0_RX_PTB16 KINETIS_MUX('B',16,3)
#define UART0_RX_PTD6 KINETIS_MUX('D',6,3)
#define UART0_TX_PTA14 KINETIS_MUX('A',14,3)
#define UART0_TX_PTA2 KINETIS_MUX('A',2,2)
#define UART0_TX_PTB17 KINETIS_MUX('B',17,3)
#define UART0_TX_PTD7 KINETIS_MUX('D',7,3)
#define UART1_CTS_b_PTC2 KINETIS_MUX('C',2,3)
#define UART1_CTS_b_PTE2 KINETIS_MUX('E',2,3)
#define UART1_RTS_b_PTC1 KINETIS_MUX('C',1,3)
#define UART1_RTS_b_PTE3 KINETIS_MUX('E',3,3)
#define UART1_RX_PTC3 KINETIS_MUX('C',3,3)
#define UART1_RX_PTE1 KINETIS_MUX('E',1,3)
#define UART1_TX_PTC4 KINETIS_MUX('C',4,3)
#define UART1_TX_PTE0 KINETIS_MUX('E',0,3)
#define UART2_CTS_b_PTD1 KINETIS_MUX('D',1,3)
#define UART2_RTS_b_PTD0 KINETIS_MUX('D',0,3)
#define UART2_RX_PTD2 KINETIS_MUX('D',2,3)
#define UART2_TX_PTD3 KINETIS_MUX('D',3,3)
#define XTAL0_PTA19 KINETIS_MUX('A',19,0)
#define ADC0_SE4a_PTE16 KINETIS_MUX('E',16,0)
#define ADC0_SE5a_PTE17 KINETIS_MUX('E',17,0)
#define ADC0_SE6a_PTE18 KINETIS_MUX('E',18,0)
#define ADC0_SE7a_PTE19 KINETIS_MUX('E',19,0)
#define CLKOUT32K_PTE0 KINETIS_MUX('E',0,1)
#define CLKOUT32K_PTE26 KINETIS_MUX('E',26,1)
#define CMP0_OUT_PTA1 KINETIS_MUX('A',1,4)
#define CMP1_OUT_PTA2 KINETIS_MUX('A',2,4)
#define EWM_IN_PTA0 KINETIS_MUX('A',0,5)
#define EWM_IN_PTB1 KINETIS_MUX('B',1,5)
#define EWM_OUT_b_PTA3 KINETIS_MUX('A',3,5)
#define FTM0_CH0_PTE24 KINETIS_MUX('E',24,3)
#define FTM0_CH1_PTE25 KINETIS_MUX('E',25,3)
#define FTM0_FLT0_PTA19 KINETIS_MUX('A',19,2)
#define FTM0_FLT1_PTB2 KINETIS_MUX('B',2,4)
#define FTM0_FLT1_PTC0 KINETIS_MUX('C',0,6)
#define FTM0_FLT2_PTB1 KINETIS_MUX('B',1,4)
#define FTM0_FLT3_PTA4 KINETIS_MUX('A',4,5)
#define FTM0_FLT3_PTE16 KINETIS_MUX('E',16,6)
#define FTM1_CH0_PTA2 KINETIS_MUX('A',2,6)
#define FTM1_CH1_PTA1 KINETIS_MUX('A',1,6)
#define FTM2_FLT0_PTA3 KINETIS_MUX('A',3,4)
#define FTM2_QD_PHA_PTA1 KINETIS_MUX('A',1,5)
#define FTM2_QD_PHB_PTA2 KINETIS_MUX('A',2,5)
#define FTM_CLKIN0_PTE16 KINETIS_MUX('E',16,4)
#define FTM_CLKIN1_PTE17 KINETIS_MUX('E',17,4)
#define I2C0_SCL_PTC6 KINETIS_MUX('C',6,7)
#define I2C0_SCL_PTE19 KINETIS_MUX('E',19,4)
#define I2C0_SDA_PTC7 KINETIS_MUX('C',7,7)
#define I2C0_SDA_PTE18 KINETIS_MUX('E',18,4)
#define LPTMR0_ALT3_PTE17 KINETIS_MUX('E',17,6)
#define LPUART0_CTS_b_PTB9 KINETIS_MUX('B',9,3)
#define LPUART0_CTS_b_PTC2 KINETIS_MUX('C',2,7)
#define LPUART0_CTS_b_PTD1 KINETIS_MUX('D',1,6)
#define LPUART0_CTS_b_PTE6 KINETIS_MUX('E',6,3)
#define LPUART0_RTS_b_PTC1 KINETIS_MUX('C',1,7)
#define LPUART0_RTS_b_PTC18 KINETIS_MUX('C',18,3)
#define LPUART0_RTS_b_PTD0 KINETIS_MUX('D',0,6)
#define LPUART0_RX_PTB10 KINETIS_MUX('B',10,3)
#define LPUART0_RX_PTC16 KINETIS_MUX('C',16,3)
#define LPUART0_RX_PTC3 KINETIS_MUX('C',3,7)
#define LPUART0_RX_PTD2 KINETIS_MUX('D',2,6)
#define LPUART0_RX_PTE5 KINETIS_MUX('E',5,3)
#define LPUART0_TX_PTB11 KINETIS_MUX('B',11,3)
#define LPUART0_TX_PTC17 KINETIS_MUX('C',17,3)
#define LPUART0_TX_PTC4 KINETIS_MUX('C',4,7)
#define LPUART0_TX_PTD3 KINETIS_MUX('D',3,6)
#define LPUART0_TX_PTE4 KINETIS_MUX('E',4,3)
#define PTE16 KINETIS_MUX('E',16,1)
#define PTE17 KINETIS_MUX('E',17,1)
#define PTE18 KINETIS_MUX('E',18,1)
#define PTE19 KINETIS_MUX('E',19,1)
#define SPI0_PCS0_PTC0 KINETIS_MUX('C',0,7)
#define SPI0_PCS0_PTE16 KINETIS_MUX('E',16,2)
#define SPI0_SCK_PTE17 KINETIS_MUX('E',17,2)
#define SPI0_SIN_PTE19 KINETIS_MUX('E',19,2)
#define SPI0_SOUT_PTE18 KINETIS_MUX('E',18,2)
#define UART0_RX_PTB0 KINETIS_MUX('B',0,7)
#define UART0_TX_PTB1 KINETIS_MUX('B',1,7)
#define UART2_CTS_b_PTE18 KINETIS_MUX('E',18,3)
#define UART2_RTS_b_PTE19 KINETIS_MUX('E',19,3)
#define UART2_RX_PTE17 KINETIS_MUX('E',17,3)
#define UART2_TX_PTE16 KINETIS_MUX('E',16,3)

#endif /* _ZEPHYR_DTS_BINDING_MKV31F512VLL12_ */
